Revit 2020 API
FilePath Properties
The FilePath type exposes the following members.
Properties
Name | Description
CentralServerPath
 A path to the location of the central Revit server.
 (Inherited from ModelPath.)
CloudPath
 Whether this path represents a path on an Autodesk server such as BIM360.
 (Inherited from ModelPath.)
Empty
 Whether this path is empty
 (Inherited from ModelPath.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ModelPath.)
ServerPath
 Whether this path is a server path (as opposed to a file path or cloud path)
 (Inherited from ModelPath.)
See Also
FilePath Class
Autodesk.Revit.DB Namespace